## ETL Project: CSV to SQL using Python

#### Objective:

This project is aimed to extract csv files from a folder,transform the data using Python, and load the data into an SQL 
Server database.

#### Tools/Technologies:

* Python 3.12.1
* Pandas Library
* Pypyodbc Library
* Sqlalchemy Library
* SQL Server 2022 version
* SQL Server Management Studio (SSMS)

#### Load Libraries

In [33]:
import pandas as pd
from sqlalchemy import create_engine
import pypyodbc as odbc
from sqlalchemy.engine import  URL

#### Extract:

* Read CSV files from a designated folder using Pandas
* Handle errors and exception

#### People dataset

In [34]:
df_1= pd.read_csv("C:/Users/DELL/Desktop/KIDDIE_ACADEMY/people.csv")
df_1.head(5)

          Sales_person SP_ID     Team   Location
0         Barr Faughny  SP01  Yummies  Hyderabad
1  Dennison Crosswaite  SP02  Yummies  Hyderabad
2      Gunar Cockshoot  SP03  Yummies  Hyderabad
3       Wilone O'Kielt  SP04   Delish  Hyderabad
4         Gigi Bohling  SP05   Delish  Hyderabad

#### Transform:

* Clean and preprocess data(e.g., Handle missing values, data type conversion)
* Perform data transformation (e.g., aggregations, calculations)
* Data quality checks (e.g., data validation, data profiling)

* Checking Nulls

In [35]:
df_1.isnull().sum()

Sales_person    0
SP_ID           0
Team            5
Location        0
dtype: int64

* Correcting Nulls

In [36]:
df_1.fillna(value='N/A',inplace=True)

In [37]:
df_1.isnull().sum()

Sales_person    0
SP_ID           0
Team            0
Location        0
dtype: int64

* Data Profiling

In [38]:
df_1.nunique()

Sales_person    33
SP_ID           33
Team             4
Location         4
dtype: int64

* Data Overview

In [39]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sales_person  33 non-null     object
 1   SP_ID         33 non-null     object
 2   Team          33 non-null     object
 3   Location      33 non-null     object
dtypes: object(4)
memory usage: 1.2+ KB

#### Products dataset

In [40]:
df_2= pd.read_csv("C:/Users/DELL/Desktop/KIDDIE_ACADEMY/products.csv")
df_2.head(5)

  Product_ID          Product Category   Size  Cost_per_Box
0        P01        Milk Bars     Bars  LARGE          1.52
1        P02   50% Dark Bites    Bites  LARGE          2.57
2        P03     Almond Choco     Bars  LARGE          9.60
3        P04  Raspberry Choco     Bars  LARGE          4.09
4        P05  Mint Chip Choco     Bars  LARGE          1.54

* Checking Nulls

In [41]:
df_2.isnull().sum()

Product_ID      0
Product         0
Category        0
Size            0
Cost_per_Box    0
dtype: int64

* Data Profiling

In [42]:
df_2.nunique()

Product_ID      22
Product         22
Category         3
Size             2
Cost_per_Box    22
dtype: int64

* Data Overview

In [43]:
df_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Product_ID    22 non-null     object
 1   Product       22 non-null     object
 2   Category      22 non-null     object
 3   Size          22 non-null     object
 4   Cost_per_Box  22 non-null     float64
dtypes: float64(1), object(4)
memory usage: 1012.0+ bytes

#### Sales dataset

In [44]:
df_3= pd.read_csv("C:/Users/DELL/Desktop/KIDDIE_ACADEMY/sales.csv")
df_3.head(5)

  Sales_Person Geo Product_ID      Date  Amount  Customers  Boxes
0         SP01  G4        P04  01/01/21    8414        276    495
1         SP02  G3        P14  01/01/21     532        317     54
2         SP12  G2        P08  01/01/21    5376        178    269
3         SP01  G4        P15  01/01/21     259         32     22
4         SP19  G2        P18  01/01/21    5530          4    179

* Checking Nulls

In [45]:
df_3.isnull().sum()

Sales_Person    0
Geo             0
Product_ID      0
Date            0
Amount          0
Customers       0
Boxes           0
dtype: int64

* Data Profiling

In [46]:
df_3.nunique()

Sales_Person      25
Geo                6
Product_ID        22
Date             325
Amount          2138
Customers        559
Boxes           1295
dtype: int64

* Data Overview

In [47]:
df_3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7617 entries, 0 to 7616
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sales_Person  7617 non-null   object
 1   Geo           7617 non-null   object
 2   Product_ID    7617 non-null   object
 3   Date          7617 non-null   object
 4   Amount        7617 non-null   int64
 5   Customers     7617 non-null   int64
 6   Boxes         7617 non-null   int64
dtypes: int64(3), object(4)
memory usage: 416.7+ KB

#### Load:

* Connect to SQL Server database using Python

In [48]:
server= 'DESKTOP-ULUKUD4'
database= 'Kiddie'
driver= '{SQL Server}'
connection= URL.create('mssql+pyodbc',
                           query={'odbc_connect': f'DRIVER={driver};SERVER={server};DATABASE={database}'})
engine= create_engine(connection,module=odbc)

* Create tables and load data into SQL Server database

In [49]:
df_1.to_sql('people',con=engine,if_exists='replace',index=False)
df_2.to_sql('products',con=engine,if_exists='replace',index=False)
df_3.to_sql('sales',con=engine,if_exists='replace',index=False)

142

Project done by: Jones Osele

email: oselejones@gmail.com